rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "director", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "123"], ["rating", "G"], ["director", "456"], ["release_date", "2018-10-03 00:00:00.000000"], ["created_at", "2018-10-03 19:09:03.992878"], ["updated_at", "2018-10-03 19:09:03.992878"]]

  def same_director
    @movie = Movie.find(params[:id])
    if @movie.director && @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "2"]]